// The options to be provided are the sender and search dates, recipient, and subject. If the subject is unknown, you can comment on the line.
EmailEvents
| where RecipientEmailAddress == "maildelrecipiente@dominio.com"
      and SenderFromAddress == "remitente@dominio.com"
      and Subject contains "texto del asunto"
      and Timestamp between (datetime(2025-09-28T00:00:00Z) .. datetime(2025-09-29T00:00:00Z))
| summarize MsgCount = count() by bin(Timestamp, 1h), RecipientEmailAddress, SenderFromAddress, Subject
| project Hora=Timestamp, RecipientEmailAddress, SenderFromAddress, Subject, MsgCount
| order by Hora desc
